Autodesk.Revit.DB.Structure.LoadCombination.SetComponents(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.LoadComponent})
Sets a collection of the load combination components.
components:
A collection of the load combination components.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LoadCombination.GetComponents
Returns collection of the load combination components.
Returns:
A collection of the load combination components.
Since:
2016

Autodesk.Revit.DB.Structure.LoadCombination.SetUsageIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Sets a collection of the load combination usage IDs.
usageIds:
A collection of the load combination usage IDs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LoadCombination.GetUsageIds
Returns collection of the load combination usage IDs.
Returns:
A collection of the load combination usage IDs.
Since:
2016

Autodesk.Revit.DB.Structure.LoadCombination.GetCaseAndCombinationIds
Returns collection of the load combination case and combination IDs.
Remarks:
Load combination components could be load cases or other load combinations.
To set them with factors use Autodesk.Revit.DB.Structure.LoadCombination.SetComponents(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Structure.LoadComponent}) method.
Returns:
A collection of the load combination case and combination IDs.
Since:
2016

Autodesk.Revit.DB.Structure.LoadCombination.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Structure.LoadCombinationType,Autodesk.Revit.DB.Structure.LoadCombinationState)
Creates a new LoadCombination.
document:
The Document to which new load combination element will be added.
name:
The name of the load combination.
type:
The type of the load combination.
state:
The state of the load combination.
Returns:
The newly created load combination element if successful, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given name is not unique
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.LoadCombination.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new default LoadCombination.
document:
The Document to which new load combination element will be added.
name:
The name of the load combination.
Returns:
The newly created load combination element if successful, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given name is not unique
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LoadCombination.IsThirdPartyGenerated
Indicates if the load combination was created by API.
Since:
2016

Autodesk.Revit.DB.Structure.LoadCombination.State
The state of the load combination.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.LoadCombination.Type
The type of the load combination.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.LoadCombination
An object that represents a load combination.
Since:
2016